; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v12 ?v2)
             (pred_12 ?v1 ?v9)
             (pred_5 ?v12 ?v9)
             (pred_10 ?v8 ?v12 )
	     (pred_6 ?v12)
             (pred_8 ?v11)
             (pred_1 ?v1)
             (pred_2 ?v9)
             (pred_4 ?v12)
             (pred_7 ?v1)
             (pred_11 ?v12)
             (pred_3 ))



(:action op_5
:parameters (?v13 ?v3 ?v4 ?v5)
:precondition (and (pred_8 ?v13) (pred_8 ?v3) (pred_1 ?v4) (pred_2 ?v5)
          (pred_9 ?v13 ?v3) (pred_12 ?v4 ?v5)
                   (pred_5 ?v3 ?v5) (pred_6 ?v13) 
                   (pred_4 ?v3) (pred_7 ?v4))
:effect (and  (pred_11 ?v3) (not (pred_4 ?v3))))


(:action op_3
:parameters (?v13 ?v10)
:precondition (and (pred_8 ?v13) (pred_8 ?v10)
               (pred_6 ?v13) (pred_9 ?v13 ?v10) (pred_11 ?v10))
:effect (and (pred_6 ?v10) (not (pred_6 ?v13))))

(:action op_2
:parameters (?v13 ?v4)
:precondition (and (pred_8 ?v13) (pred_1 ?v4) 
                  (pred_6 ?v13) (pred_10 ?v4 ?v13) (pred_3 ))
:effect (and (pred_7 ?v4)
   (not (pred_10 ?v4 ?v13)) (not (pred_3 ))))


(:action op_4
:parameters (?v13 ?v7 ?v6)
:precondition (and (pred_8 ?v13) (pred_1 ?v7) (pred_1 ?v6)
                  (pred_6 ?v13) (pred_7 ?v6) (pred_10 ?v7 ?v13))
:effect (and (pred_7 ?v7) (pred_10 ?v6 ?v13)
        (not (pred_7 ?v6)) (not (pred_10 ?v7 ?v13))))

(:action op_1
:parameters (?v13 ?v4)
:precondition (and (pred_8 ?v13) (pred_1 ?v4) 
                  (pred_6 ?v13) (pred_7 ?v4))
:effect (and (pred_3 ) (pred_10 ?v4 ?v13) (not (pred_7 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_14 obj_17 obj_10 obj_15 obj_20 obj_01 obj_12 obj_03 obj_06 obj_19 obj_11 obj_09 obj_04 obj_05 obj_02 obj_07
    obj_18 obj_13
    obj_08 obj_16
    )

    (:init
       (pred_3)

       (pred_8 obj_14)
       (pred_8 obj_17)
       (pred_8 obj_10)
       (pred_8 obj_15)
       (pred_8 obj_20)
       (pred_8 obj_01)
       (pred_8 obj_12)
       (pred_8 obj_03)
       (pred_8 obj_06)
       (pred_8 obj_19)
       (pred_8 obj_11)
       (pred_8 obj_09)
       (pred_8 obj_04)
       (pred_8 obj_05)
       (pred_8 obj_02)
       (pred_8 obj_07)
       (pred_2 obj_18)
       (pred_2 obj_13)
       (pred_1 obj_08)
       (pred_1 obj_16)

       (pred_9 obj_14 obj_20)
       (pred_9 obj_14 obj_17)
       (pred_9 obj_17 obj_01)
       (pred_9 obj_17 obj_10)
       (pred_9 obj_17 obj_14)
       (pred_9 obj_10 obj_12)
       (pred_9 obj_10 obj_15)
       (pred_9 obj_10 obj_17)
       (pred_9 obj_15 obj_03)
       (pred_9 obj_15 obj_10)
       (pred_9 obj_20 obj_06)
       (pred_9 obj_20 obj_01)
       (pred_9 obj_20 obj_14)
       (pred_9 obj_01 obj_19)
       (pred_9 obj_01 obj_12)
       (pred_9 obj_01 obj_17)
       (pred_9 obj_01 obj_20)
       (pred_9 obj_12 obj_11)
       (pred_9 obj_12 obj_03)
       (pred_9 obj_12 obj_10)
       (pred_9 obj_12 obj_01)
       (pred_9 obj_03 obj_09)
       (pred_9 obj_03 obj_15)
       (pred_9 obj_03 obj_12)
       (pred_9 obj_06 obj_04)
       (pred_9 obj_06 obj_19)
       (pred_9 obj_06 obj_20)
       (pred_9 obj_19 obj_05)
       (pred_9 obj_19 obj_11)
       (pred_9 obj_19 obj_01)
       (pred_9 obj_19 obj_06)
       (pred_9 obj_11 obj_02)
       (pred_9 obj_11 obj_09)
       (pred_9 obj_11 obj_12)
       (pred_9 obj_11 obj_19)
       (pred_9 obj_09 obj_07)
       (pred_9 obj_09 obj_03)
       (pred_9 obj_09 obj_11)
       (pred_9 obj_04 obj_05)
       (pred_9 obj_04 obj_06)
       (pred_9 obj_05 obj_02)
       (pred_9 obj_05 obj_19)
       (pred_9 obj_05 obj_04)
       (pred_9 obj_02 obj_07)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_02 obj_05)
       (pred_9 obj_07 obj_09)
       (pred_9 obj_07 obj_02)
       (pred_4 obj_15)
       (pred_4 obj_05)
       (pred_5  obj_15 obj_18)
       (pred_5  obj_05 obj_13)
       (pred_11 obj_14)
       (pred_11 obj_17)
       (pred_11 obj_10)
       (pred_11 obj_20)
       (pred_11 obj_01)
       (pred_11 obj_12)
       (pred_11 obj_03)
       (pred_11 obj_06)
       (pred_11 obj_19)
       (pred_11 obj_11)
       (pred_11 obj_09)
       (pred_11 obj_04)
       (pred_11 obj_02)
       (pred_11 obj_07)

       (pred_12  obj_08 obj_18)
       (pred_12  obj_16 obj_13)
       (pred_10 obj_08 obj_01)
       (pred_10 obj_16 obj_09)
       (pred_6 obj_04)
    )

    (:goal (and
       (pred_10 obj_08 obj_07)
       (pred_10 obj_16 obj_20)
    ))
(:constraints
  (always (not (pred_6 obj_12)))
)
)

; plan
1. (op_3 obj_04 obj_06)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_06)
   goals met: 0 of 2
2. (op_3 obj_06 obj_19)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_19)
   goals met: 0 of 2
3. (op_3 obj_19 obj_11)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_11)
   goals met: 0 of 2
4. (op_3 obj_11 obj_09)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_09)
   goals met: 0 of 2
5. (op_2 obj_09 obj_16)
   deleted: (pred_10 obj_16 obj_09) (pred_3)
   added: (pred_7 obj_16)
   goals met: 0 of 2
6. (op_3 obj_09 obj_11)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_11)
   goals met: 0 of 2
7. (op_3 obj_11 obj_19)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_19)
   goals met: 0 of 2
8. (op_3 obj_19 obj_01)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_01)
   goals met: 0 of 2
9. (op_3 obj_01 obj_20)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_20)
   goals met: 0 of 2
10. (op_1 obj_20 obj_16)
   deleted: (pred_7 obj_16)
   added: (pred_3) (pred_10 obj_16 obj_20)
   goals met: 1 of 2
11. (op_3 obj_20 obj_01)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_01)
   goals met: 1 of 2
12. (op_2 obj_01 obj_08)
   deleted: (pred_10 obj_08 obj_01) (pred_3)
   added: (pred_7 obj_08)
   goals met: 1 of 2
13. (op_3 obj_01 obj_19)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_19)
   goals met: 1 of 2
14. (op_3 obj_19 obj_11)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_11)
   goals met: 1 of 2
15. (op_3 obj_11 obj_09)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_09)
   goals met: 1 of 2
16. (op_3 obj_09 obj_07)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_07)
   goals met: 1 of 2
17. (op_1 obj_07 obj_08)
   deleted: (pred_7 obj_08)
   added: (pred_3) (pred_10 obj_08 obj_07)
   goals met: 2 of 2
